# -*- coding:utf8 -*-

configs = {

#SQLData
'db':{
    'host':'127.0.0.1',
    'user' : 'CNTrain',
    'password' : 'password',
    'db' : 'CNTrain',
    'port':3306
},

#列车等级信息
'grade_list':["T","K","","D","Z","C","L","Y","G"],

#第三方来源网址,分为前缀和后缀
#这个站点用于提供大范围列车的时刻表，可能不能实时更新，但响应快
'third_party_url' : ['http://qq.ip138.com/train/','.htm'],

#官方站点信息
#这个文件包含站名和拼音名，随实际状况更新，序号可能变化
'station_url' : 'https://kyfw.12306.cn/otn/resources/js/framework/station_name.js',

#中文维基百科主域名
'wiki_url' : 'https://zh.wikipedia.org',

#省份简称对应，用于amap.py
'full_abbr_province_dict' : {'北京市':'京','浙江省':'浙','天津市':'津', '安徽省':'皖','上海市':'沪','福建省':'闽','重庆市':'渝','江西省':'赣','香港特别行政区':'港','香港特別行政區':'港','山东省':'鲁','澳门特别行政区':'澳','澳门特别行政區':'澳' ,'河南省': '豫', '内蒙古自治区':'蒙','湖北省':'鄂', '新疆维吾尔自治区':'新', '湖南省':'湘','宁夏回族自治区':'宁','广东省':'粤','西藏自治区':'藏','海南省':'琼', '广西壮族自治区':'桂','四川省':'川','河北省':'冀','贵州省':'贵','山西省': '晋','云南省':'云','辽宁省':'辽','陕西省':'陕','吉林省':'吉','甘肃省':'甘','黑龙江省':'黑','青海省':'青','江苏省':'苏',"台湾省"：'台'},

#高德地图api_key
'amap_web_key' : 'ee57ba72408511a2322d64b3f65dc273',

#谷歌地图api_key
'google_key':'AIzaSyA7fsh-d7y5oWJL9HP64blPn3Zy--6_Vq8'
}